[
"Cats are good for our health. People who own cats have a lower risk of cardio-vascular disease than non-cat owners. Elderly cat owners suffer less from depression and loneliness than non-cat owners.",
"Cats can be trained. Teach your cat to share a “high five” with you by rewarding her with a special treat every time she lifts her paw.",
"Cats need to interact with people from two weeks of age to enable them to be social towards humans. After 16 weeks of age it is very difficult to tame a cat.",
"Psychological studies have shown that cat owners are more logical and practical than dog owners. They tend to be more introverted than dog owners. Cat owners, however, tell more stories about their cats than dog owners.",
"The record number of cats kept by any one person was by an owner named Jack Wright, from Ontario, Canada who kept 689 cats!",
"Cats have 30 teeth (dogs have 42) and most of us know how sharp they are!",
"Cats have a reflective layer in their eyes, known as the tapetum lucidum, which magnifies incoming light allowing them to see up to 6 times better than humans can in low light. Cats (as well as dogs) also have a ‘third eyelid’ called the nictitating membrane which is found on the inside corner of the eye which is an extra protective function of the eye.",
"Cats have 32 muscles in their ears (humans have only 12). This gives the ear mobility, enabling it to precisely locate prey such as mice or the opening of their cat food! Cats can also hear frequencies that are both below and above those that can be heard by humans. The ear also has the job of helping to maintain balance and the ability to right themselves when falling – which is where the phrase “Cats always land on their feet” came from.",
"More cats are left-pawed than right.",
"The texture of cat food is more important to cats than taste and cats can often be quite fussy about the smells of food. If your cat have ever licked you, you might compare the feel of their tongue to that of coarse sandpaper – that’s because a cats' tongue is covered in tiny backwards facing thorn like barbs that guide food to the back of the mouth. These rough tongues are also perfectly designed for grooming and lapping up water.",
"Cats can retract their front claws. This keeps them sharp so they can be used for climbing and of course, as effective weapons!",
"Cats rub against us and scratch as a form of communication. They have scent glands on their cheeks and paws, so rubbing against us or scratching on vertical surfaces transfers their scent.",
"Around 75% of cats respond to catnip. This herb stimulates those cats that are genetically programmed to respond.",
"Those long whiskers around your cats' mouth and face which form a vital part of their sense of touch. These whiskers are attached to nerve cells and are used to judge the size of openings as well as providing your cat information about everything he/she touches, as well as shifts in air pressure.",
"Cats can travel at speeds of up to 30km per hour.",
"The largest breed of cat in Australia is the Maine Coon. Males can regularly weigh up to 12kgs!",
"Cats have been domesticated for around 4,000 years. While they were once valued for their hunting abilities, they are now valued for their companionship and loving behaviour.",
"While not well known, the collective nouns used for cats and kittens are a clowder of cats and a kindle of kittens.",
"Our domestic cats are known as little cats. They differ from large cats such as lions and tigers because they are naturally active at night and can purr.",
"Cats are now the most popular pet in the UK and in the US.",
]
